In [40]:
import pandas as pd

# series

In [41]:
data = [1,2,3,4,5]

In [42]:
s = pd.Series(data)

In [43]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [44]:
index = ['Linha' + str(i) for i in range(5)]

In [45]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [46]:
s = pd.Series(data, index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [47]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [48]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [49]:
s1 = s +2 
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [50]:
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

In [51]:
25*24*23*22*21*20*19*18*17*16*15*14*13*12*11

4274473667143680000

In [52]:
60*59*58*57*56*55

36045979200

In [53]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [54]:
df1 = pd.DataFrame(data = data)

In [55]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
index = ['Linha' + str(i) for i in range(3)]

In [57]:
df1 = pd.DataFrame(data, index)

In [58]:
coluna = ['Coluna' + str(1) for i in range(3)]

In [59]:
df1 = pd.DataFrame(data, index, coluna)
df1

        Coluna1  Coluna1  Coluna1
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [60]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [61]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [62]:
data = [(1,2,3),(4,5,6),(7,8,9)]

In [63]:
df3 = pd.DataFrame(data, index, coluna)

In [64]:
df3

        Coluna1  Coluna1  Coluna1
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [65]:
df1[df1 > 0] = 'A'

In [66]:
df1

       Coluna1 Coluna1 Coluna1
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [67]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [68]:
df3[df3 > 0] = 'C'
df3

       Coluna1 Coluna1 Coluna1
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [74]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna1 Coluna1 Coluna1 Coluna0 Coluna1 Coluna2 Coluna1 Coluna1 Coluna1
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C